mcp-validation.org
#+TITLE: MCP Tools Validation
#+AUTHOR: Claude
#+DATE: [2025-02-27 Thu]
#+PROPERTY: header-args :mkdirp yes :tangle yes

* MCP Tools Validation
This file provides a systematic approach to validate the MCP (Model Context Protocol) tools available for Emacs integration via mcp.el.

** Usage Guide
   
This org-mode file is designed to be used with org-babel and can be tangled to generate multiple Emacs Lisp files for validating MCP tools. The validation suite can be used to:

1. Check the availability and functionality of each MCP tool
2. Test connections to different MCP servers
3. Run integration tests across multiple tools
4. Generate comprehensive validation reports

*** Getting Started

To use this validation suite:

1. Open this file in Emacs
2. Run ~org-babel-tangle~ (C-c C-v t) to generate all the necessary Elisp files
3. Load the main validation runner: ~(load-file "mcp-validation-run.el")~
4. Run the validation suite: ~M-x mcp-run-validation-suite~

Alternatively, you can evaluate individual code blocks or tangle specific sections as needed.

*** File Organization

The validation suite is organized into the following modules:

| Module                             | Description                                    |
|------------------------------------+------------------------------------------------|
| mcp-validation-setup.el            | Core validation infrastructure                 |
| mcp-validation-filesystem.el       | Filesystem tool validation                     |
| mcp-validation-git.el              | Git tool validation                            |
| mcp-validation-github.el           | GitHub tool validation                         |
| mcp-validation-memory.el           | Memory/knowledge graph tool validation         |
| mcp-validation-iterm.el            | iTerm terminal tool validation                 |
| mcp-validation-fetch.el            | Fetch/URL tool validation                      |
| mcp-validation-sequential-thinking.el | Sequential thinking tool validation         |
| mcp-server-test.el                 | Server connection testing                      |
| mcp-integration-test.el            | Comprehensive integration tests                |
| mcp-validation-run.el              | Main validation runner                         |

Additionally, Mermaid diagrams are generated for tool visualization and architecture overviews.

** Setup
:PROPERTIES:
:header-args: :tangle mcp-validation-setup.el
:END:

#+begin_src emacs-lisp
  ;; Setup for MCP tools validation
  (require 'mcp)
  (require 'cl-lib)
  (require 'json)
  
  (defvar mcp-validation-results '()
    "Alist to store validation results for MCP tools.")
  
  (defun mcp-validate-tool (tool-name server-name expected-params)
    "Validate if a specific MCP tool is available and functioning.
  TOOL-NAME is the name of the tool to validate.
  SERVER-NAME is the expected server providing the tool.
  EXPECTED-PARAMS is a list of expected parameters for the tool."
    (let ((result (list :tool tool-name :server server-name :status nil :message nil)))
      (condition-case err
          (progn
            ;; Check if the tool exists in mcp-available-tools
            (unless (member tool-name (mapcar #'car mcp-available-tools))
              (error "Tool not found in mcp-available-tools"))
            
            ;; Check if the tool is from the expected server
            (let ((actual-server (cdr (assoc tool-name mcp-tool-server-map))))
              (unless (string= actual-server server-name)
                (error "Tool server mismatch: expected %s, got %s" 
                       server-name actual-server)))
            
            ;; TODO: Add parameter validation when API allows it
            
            ;; If we got here, the tool passed basic validation
            (setf (plist-get result :status) 'success)
            (setf (plist-get result :message) "Tool validated successfully"))
        (error
         (setf (plist-get result :status) 'failure)
         (setf (plist-get result :message) (format "Validation failed: %s" 
                                                 (error-message-string err)))))
      
      ;; Store and return the result
      (push result mcp-validation-results)
      result))
  
  (defun mcp-validate-all-tools ()
    "Validate all MCP tools and generate a report."
    (interactive)
    (setq mcp-validation-results '())
    (with-current-buffer (get-buffer-create "*MCP Validation Results*")
      (erase-buffer)
      (org-mode)
      (insert "#+TITLE: MCP Tools Validation Results\n")
      (insert "#+DATE: " (format-time-string "[%Y-%m-%d %a]") "\n\n")
      (insert "* MCP Tools Validation Results\n\n")
      
      ;; Run all the validation functions
      (mcp-validate-filesystem-tools)
      (mcp-validate-git-tools)
      (mcp-validate-github-tools)
      (mcp-validate-memory-tools)
      (mcp-validate-iterm-tools)
      (mcp-validate-fetch-tools)
      (mcp-validate-sequential-thinking-tools)
      
      ;; Generate summary statistics
      (let ((total (length mcp-validation-results))
            (success (length (cl-remove-if-not 
                              (lambda (r) (eq (plist-get r :status) 'success))
                              mcp-validation-results))))
        (insert (format "** Summary\n\n"))
        (insert (format "- Total tools validated: %d\n" total))
        (insert (format "- Successful validations: %d\n" success))
        (insert (format "- Failed validations: %d\n\n" (- total success))))
      
      ;; Generate detailed results organized by server
      (insert "** Detailed Results by Server\n\n")
      (let ((servers (delete-dups (mapcar (lambda (r) (plist-get r :server)) 
                                          mcp-validation-results))))
        (dolist (server servers)
          (insert (format "*** %s Server\n\n" (capitalize server)))
          (let ((server-results (cl-remove-if-not 
                                 (lambda (r) (string= (plist-get r :server) server))
                                 mcp-validation-results)))
            (insert "| Tool | Status | Message |\n")
            (insert "|------+--------+---------|\n")
            (dolist (result server-results)
              (insert (format "| %s | %s | %s |\n" 
                              (plist-get result :tool)
                              (if (eq (plist-get result :status) 'success)
                                  "✓" "✗")
                              (plist-get result :message)))))))
      
      ;; Display the buffer
      (pop-to-buffer (current-buffer))))
#+end_src

** Filesystem Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-filesystem.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-filesystem-tools ()
    "Validate all filesystem MCP tools."
    (mcp-validate-tool "create_directory" "filesystem" 
                       '("directory_path"))
    
    (mcp-validate-tool "directory_tree" "filesystem" 
                       '("directory_path"))
    
    (mcp-validate-tool "edit_file" "filesystem" 
                       '("file_path" "edits"))
    
    (mcp-validate-tool "get_file_info" "filesystem" 
                       '("file_path"))
    
    (mcp-validate-tool "list_allowed_directories" "filesystem" 
                       '())
    
    (mcp-validate-tool "list_directory" "filesystem" 
                       '("directory_path"))
    
    (mcp-validate-tool "move_file" "filesystem" 
                       '("source_path" "destination_path"))
    
    (mcp-validate-tool "read_file" "filesystem" 
                       '("file_path"))
    
    (mcp-validate-tool "read_multiple_files" "filesystem" 
                       '("file_paths"))
    
    (mcp-validate-tool "search_files" "filesystem" 
                       '("search_path" "pattern"))
    
    (mcp-validate-tool "write_file" "filesystem" 
                       '("file_path" "content")))
#+end_src

** Git Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-git.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-git-tools ()
    "Validate all git MCP tools."
    (mcp-validate-tool "git_add" "git" 
                       '("path"))
    
    (mcp-validate-tool "git_checkout" "git" 
                       '("branch"))
    
    (mcp-validate-tool "git_commit" "git" 
                       '("message"))
    
    (mcp-validate-tool "git_create_branch" "git" 
                       '("branch_name" "base_branch"))
    
    (mcp-validate-tool "git_diff" "git" 
                       '("ref1" "ref2"))
    
    (mcp-validate-tool "git_diff_staged" "git" 
                       '())
    
    (mcp-validate-tool "git_diff_unstaged" "git" 
                       '())
    
    (mcp-validate-tool "git_log" "git" 
                       '("max_count"))
    
    (mcp-validate-tool "git_reset" "git" 
                       '())
    
    (mcp-validate-tool "git_show" "git" 
                       '("commit"))
    
    (mcp-validate-tool "git_status" "git" 
                       '()))
#+end_src

** GitHub Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-github.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-github-tools ()
    "Validate all GitHub MCP tools."
    (mcp-validate-tool "add_issue_comment" "github" 
                       '("owner" "repo" "issue_number" "body"))
    
    (mcp-validate-tool "create_branch" "github" 
                       '("owner" "repo" "branch" "sha"))
    
    (mcp-validate-tool "create_issue" "github" 
                       '("owner" "repo" "title" "body" "labels"))
    
    (mcp-validate-tool "create_or_update_file" "github" 
                       '("owner" "repo" "path" "content" "message" "branch"))
    
    (mcp-validate-tool "create_pull_request" "github" 
                       '("owner" "repo" "title" "body" "head" "base"))
    
    (mcp-validate-tool "create_repository" "github" 
                       '("name" "description" "private"))
    
    (mcp-validate-tool "fork_repository" "github" 
                       '("owner" "repo" "organization"))
    
    (mcp-validate-tool "get_file_contents" "github" 
                       '("owner" "repo" "path" "ref"))
    
    (mcp-validate-tool "get_issue" "github" 
                       '("owner" "repo" "issue_number"))
    
    (mcp-validate-tool "list_commits" "github" 
                       '("owner" "repo" "branch"))
    
    (mcp-validate-tool "list_issues" "github" 
                       '("owner" "repo" "state" "labels"))
    
    (mcp-validate-tool "push_files" "github" 
                       '("owner" "repo" "files" "message" "branch"))
    
    (mcp-validate-tool "search_code" "github" 
                       '("query"))
    
    (mcp-validate-tool "search_issues" "github" 
                       '("query"))
    
    (mcp-validate-tool "search_repositories" "github" 
                       '("query"))
    
    (mcp-validate-tool "search_users" "github" 
                       '("query"))
    
    (mcp-validate-tool "update_issue" "github" 
                       '("owner" "repo" "issue_number" "title" "body" "state" "labels")))
#+end_src

** Memory Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-memory.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-memory-tools ()
    "Validate all memory MCP tools."
    (mcp-validate-tool "add_observations" "memory" 
                       '("observations"))
    
    (mcp-validate-tool "create_entities" "memory" 
                       '("entities"))
    
    (mcp-validate-tool "create_relations" "memory" 
                       '("relations"))
    
    (mcp-validate-tool "delete_entities" "memory" 
                       '("entity_names"))
    
    (mcp-validate-tool "delete_observations" "memory" 
                       '("observations"))
    
    (mcp-validate-tool "delete_relations" "memory" 
                       '("relations"))
    
    (mcp-validate-tool "open_nodes" "memory" 
                       '("node_names"))
    
    (mcp-validate-tool "read_graph" "memory" 
                       '())
    
    (mcp-validate-tool "search_nodes" "memory" 
                       '("query")))
#+end_src

** iTerm Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-iterm.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-iterm-tools ()
    "Validate all iTerm MCP tools."
    (mcp-validate-tool "read_terminal_output" "iterm-mcp" 
                       '())
    
    (mcp-validate-tool "send_control_character" "iterm-mcp" 
                       '("character"))
    
    (mcp-validate-tool "write_to_terminal" "iterm-mcp" 
                       '("text")))
#+end_src

** Fetch Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-fetch.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-fetch-tools ()
    "Validate all fetch MCP tools."
    (mcp-validate-tool "fetch" "fetch" 
                       '("url" "extract_as_markdown")))
#+end_src

** Sequential Thinking Tools Validation
:PROPERTIES:
:header-args: :tangle mcp-validation-sequential-thinking.el
:END:

#+begin_src emacs-lisp
  (defun mcp-validate-sequential-thinking-tools ()
    "Validate sequential thinking MCP tools."
    (mcp-validate-tool "sequentialthinking" "sequential-thinking" 
                       '("thought" "next_thought_needed" "thought_number" 
                         "total_thoughts" "is_revision" "revises_thought"
                         "branch_from_thought" "branch_id" "needs_more_thoughts")))
#+end_src

