mcp-validation.org
** Tool Parameter Visualization
:PROPERTIES:
:header-args: :tangle yes :file mcp-tools-diagram.mmd
:END:

#+begin_src mermaid
  %%{init: {'theme': 'neutral', 'themeVariables': { 'fontSize': '12px'}}}%%
  classDiagram
    class MCP_Tools {
      +validate()
      +report()
    }
    
    MCP_Tools <|-- FilesystemTools
    MCP_Tools <|-- GitTools
    MCP_Tools <|-- GitHubTools
    MCP_Tools <|-- MemoryTools
    MCP_Tools <|-- iTermTools
    MCP_Tools <|-- FetchTools
    MCP_Tools <|-- SequentialThinkingTools
    
    class FilesystemTools {
      +create_directory(directory_path)
      +directory_tree(directory_path)
      +edit_file(file_path, edits)
      +get_file_info(file_path)
      +list_allowed_directories()
      +list_directory(directory_path)
      +move_file(source_path, destination_path)
      +read_file(file_path)
      +read_multiple_files(file_paths)
      +search_files(search_path, pattern)
      +write_file(file_path, content)
    }
    
    class GitTools {
      +git_add(path)
      +git_checkout(branch)
      +git_commit(message)
      +git_create_branch(branch_name, base_branch)
      +git_diff(ref1, ref2)
      +git_diff_staged()
      +git_diff_unstaged()
      +git_log(max_count)
      +git_reset()
      +git_show(commit)
      +git_status()
    }
    
    class GitHubTools {
      +add_issue_comment(owner, repo, issue_number, body)
      +create_branch(owner, repo, branch, sha)
      +create_issue(owner, repo, title, body, labels)
      +create_or_update_file(owner, repo, path, content, message, branch)
      +create_pull_request(owner, repo, title, body, head, base)
      +create_repository(name, description, private)
      +fork_repository(owner, repo, organization)
      +get_file_contents(owner, repo, path, ref)
      +get_issue(owner, repo, issue_number)
      +list_commits(owner, repo, branch)
      +list_issues(owner, repo, state, labels)
      +push_files(owner, repo, files, message, branch)
      +search_code(query)
      +search_issues(query)
      +search_repositories(query)
      +search_users(query)
      +update_issue(owner, repo, issue_number, title, body, state, labels)
    }
    
    class MemoryTools {
      +add_observations(observations)
      +create_entities(entities)
      +create_relations(relations)
      +delete_entities(entity_names)
      +delete_observations(observations)
      +delete_relations(relations)
      +open_nodes(node_names)
      +read_graph()
      +search_nodes(query)
    }
    
    class iTermTools {
      +read_terminal_output()
      +send_control_character(character)
      +write_to_terminal(text)
    }
    
    class FetchTools {
      +fetch(url, extract_as_markdown)
    }
    
    class SequentialThinkingTools {
      +sequentialthinking(thought, next_thought_needed, thought_number, total_thoughts, is_revision, revises_thought, branch_from_thought, branch_id, needs_more_thoughts)
    }
#+end_src

** MCP Server Connection Test
:PROPERTIES:
:header-args: :tangle mcp-server-test.el
:END:

#+begin_src emacs-lisp
  (defun mcp-test-server-connections ()
    "Test connections to all MCP servers and report results."
    (interactive)
    (let ((servers '("filesystem" "git" "github" "memory" "iterm-mcp" "fetch" "sequential-thinking"))
          (results '()))
      
      (with-current-buffer (get-buffer-create "*MCP Server Connection Test*")
        (erase-buffer)
        (org-mode)
        (insert "#+TITLE: MCP Server Connection Test Results\n")
        (insert "#+DATE: " (format-time-string "[%Y-%m-%d %a]") "\n\n")
        (insert "* MCP Server Connection Test Results\n\n")
        (insert "| Server | Status | Latency (ms) | Error Message |\n")
        (insert "|--------+--------+--------------+---------------|\n")
        
        (dolist (server servers)
          (let ((start-time (current-time))
                (status nil)
                (latency nil)
                (error-msg ""))
            
            (condition-case err
                (progn
                  ;; Try to ping the server - this is a placeholder as the actual
                  ;; connection method would depend on how mcp.el implements it
                  (cond
                   ((string= server "filesystem")
                    (mcp-call-tool "list_allowed_directories" nil))
                   
                   ((string= server "git")
                    (mcp-call-tool "git_status" nil))
                   
                   ((string= server "github")
                    ;; This is just a simple request that should work with minimal permissions
                    (mcp-call-tool "search_repositories" '(:query "org:emacs-mcp")))
                   
                   ((string= server "memory")
                    (mcp-call-tool "read_graph" nil))
                   
                   ((string= server "iterm-mcp")
                    ;; This could fail if no terminal is active
                    (mcp-call-tool "read_terminal_output" nil))
                   
                   ((string= server "fetch")
                    (mcp-call-tool "fetch" '(:url "https://example.com" :extract_as_markdown t)))
                   
                   ((string= server "sequential-thinking")
                    ;; This is a minimal call to test connection
                    (mcp-call-tool "sequentialthinking" 
                                   '(:thought "Initial thought" 
                                     :next_thought_needed nil
                                     :thought_number 1
                                     :total_thoughts 1
                                     :is_revision nil
                                     :revises_thought nil
                                     :branch_from_thought nil
                                     :branch_id nil
                                     :needs_more_thoughts nil))))
                  
                  (setq status "Connected")
                  (setq latency (float-time (time-subtract (current-time) start-time))))
              
              (error
               (setq status "Failed")
               (setq latency (float-time (time-subtract (current-time) start-time)))
               (setq error-msg (error-message-string err))))
            
            ;; Log the result
            (push (list server status latency error-msg) results)
            
            ;; Output to the buffer
            (insert (format "| %s | %s | %.2f | %s |\n" 
                            server 
                            (if (string= status "Connected") "✓" "✗")
                            (* 1000 latency)
                            error-msg))))
        
        ;; Add a summary
        (let ((connected (length (cl-remove-if-not 
                                 (lambda (r) (string= (nth 1 r) "Connected"))
                                 results))))
          (insert "\n** Summary\n\n")
          (insert (format "- Total servers: %d\n" (length servers)))
          (insert (format "- Connected servers: %d\n" connected))
          (insert (format "- Failed connections: %d\n" (- (length servers) connected))))
        
        ;; Display the buffer
        (pop-to-buffer (current-buffer)))))
#+end_src

